[
  {
    "type": "Journal",
    "title": "Coupled thermo-elastic dynamics of rotating pre-twisted blades exposed to thermal shock including nonlinear rotational effects",
    "authors": "Lotfan, S., Ciğeroğlu, E.",
    "cite": "Journal of Sound and Vibration, 594, pp.118669, 2025.",
    "abstract": "Rotating blades operating under high-temperature experience intense mechanical and thermal stresses induced by centrifugal forces and thermal shock. In this research, to address this critical yet understudied topic, coupled thermo-elastic dynamics of rotating blades incorporating precise rotational effects is investigated. A comprehensive modeling approach, characterizing blade geometry in terms of pre-twist and pre-set angles is employed based on the theory of surfaces. Thermal strain–displacement field is defined based on third-order shear deformation theory in the model integrated with a third-order expansion of temperature change distribution within the blade. Rotational factors related to Coriolis, centrifugal stiffening, and rotational softening effects are considered. In the case of stiffening effects, two different modeling approaches including direct integration of centrifugal forces (DICFs), and pre-stressed dynamics about steady-state equilibrium deformations (SSEDs) are employed. When incorporating large-amplitude SSEDs in the latter, nonlinear rotational effects are incorporated into the model. To overcome the complexity arising from coupled thermo-elasticity, and rotational motion, the spectral Chebyshev technique is applied to the derived integral boundary value problems and coupled energy equations. Finally, natural frequencies, and thermal and centrifugal deformations are investigated comprehensively by including DICFs and pre-stressed dynamics. Results show that thermo-elastic dynamics of the system is highly affected by the modeling approaches used for centrifugal stiffening effects.",
    "image": "PublicationPage/Coupled-JSV-2025.svg",
    "doi": "https://doi.org/10.1016/j.jsv.2024.118669"
  },
{
    "type": "Presentation",
    "title": "Dynamic modeling of rotating axially functionally graded pre-twisted blades with chord length variations",
    "authors": "Lotfan, S., Ciğeroğlu, E.",
    "cite": "27th International Conference on Composite Structures (ICCS27), Ravenna, Italy, 3 - 6 September 2024.",
    "abstract": "In this study, dynamics of rotating blades is investigated considering geometric, material, and rotational complexities. A comprehensive modeling approach, characterizing blade geometry in terms of pre-twist and pre-set angles, as well as chord length curved variations is employed based on the theory of surfaces. Depending on the chord length variation, the width of the blade can narrow towards one end. Axially functionally graded material is considered for the blade operating under intense centrifugal stresses. The rotational stiffening effects are incorporated into the model via direct integration of centrifugal forces (DICF). The integral boundary value problem governing the dynamics of the rotating blade, is derived following extended Hamilton’s method. A framework based on Spectral Chebyshev technique is developed that enables accurately and efficiently predicting the dynamics of the problem. This framework can handle geometry and material variations in the spatial domain and provides a compact standard form formulation for complexities due to rotational effects. To validate the precision of the presented solution method, the present results are compared to those obtained through finite element method. The results are in excellent agreement, yet the presented method can solve the integral boundary value problem in a fraction of time compared to the FEM.",
    "image": "PublicationPage/ICCS27.jpg",
    "doi": "https://www.researchgate.net/publication/383871636_Dynamic_modeling_of_rotating_axially_functionally_graded_pre-twisted_blades_with_chord_length_variations"
  },
{
    "type": "Journal",
    "title": "A weak-form spectral Chebyshev technique for nonlinear vibrations of rotating functionally graded beams",
    "authors": "Lotfan, S., Dedekoy, D., Bediz, B., and Ciğeroğlu, E.",
    "cite": "Mechanics of Advanced Materials and Structures, 31(16), pp.3651–3665, 2024.",
    "abstract": "This study presents the spectral Chebyshev technique (SCT) for nonlinear vibrations of rotating beams based on a weak formulation. In addition to providing a fast-converging and precise solution for linear vibrations of structures with complex geometry, material, and physics, this method is further advanced to be able to analyze the nonlinear vibration behavior of continuous systems. Rotational motion and material gradation further complicate this nonlinear behavior. Accordingly, the beam is considered to be axially functionally graded (FG) and a model representing the forced nonlinear vibrations of the beam about steady-state equilibrium deformations (SSEDs) is developed. The model includes Coriolis, centrifugal softening, and nonlinear stiffening effects caused by coupling of the axial, chordwise, and flapwise motions, and large amplitude deformations. The integral boundary value problem for the rotating structure is discretized using the SCT and element-wise multiplication definition. As a result, mass, damping, and stiffness matrices, as well as internal nonlinear forcing functions and external forcing vectors, are obtained for a given rotating beam. This formulation provides a general representation of nonlinear strain relations in matrix form and circumvents the complexity rising from obtaining and solving the partial differential equations directly. In addition, nonlinear forcing functions are obtained in matrix form which facilitates the application of harmonic balance method easier to obtain the forced nonlinear response.",
    "image": "PublicationPage/Rotating FGM Beam.svg",
    "doi": "https://doi.org/10.1080/15376494.2023.2181472"
  },
{
    "type": "Conference",
    "title": "On the misinterpretation of structural damping in harmonic response of rotordynamic systems: commercial tools perspective",
    "authors": "Çopur, F., Lotfan, S.",
    "cite": "7th International Conference on Engineering Sciences (ICES 2024), Ankara, Turkey, February 2024.",
    "abstract": "Structural or hysteresis damping is a mechanism for energy dissipation due to friction between internal planes as the material deforms. The hysteresis cycle of a material under cyclic loading predicts energy loss in vibration cycle. Rotating and stationary damping sources have different impacts on the rotordynamic systems since they experience different vibration frequencies relative to stationary reference frame. Accurate implementation of structural damping into the equation of motion of the rotordynamic system is of critical importance. This has caused misunderstandings in the rotordynamic literature regarding stability prediction. However, its effect on harmonic response is not clearly explained and even the most widely used commercial finite element software can yield misleading results. In this study, the equation of the motion of a rotordynamic system is provided by including structural damping. The finite element model of the system is developed by using complex vector notation which is necessary to account for structural damping correctly. Natural frequency, critical speed and harmonic response are obtained based on solving the developed model. Then, these results are compared to those of commercial software for undamped and structurally damped conditions. Results showed that commercial software cannot predict the harmonic behavior of the system accurately. An additional damping effect is included in the system due to the erroneous implementation of structural damping. This causes the underestimation of the harmonic response of the system and may result in unexpected vibrations during operation.",
    "image": "PublicationPage/Rotor-Furkan-Lotfan-2024.png",
    "doi": "https://www.researchgate.net/publication/378342451_On_the_misinterpretation_of_structural_damping_in_harmonic_response_of_rotordynamic_systems_commercial_tools_perspective"
  },
{
    "type": "Presentation",
    "title": "Internal dynamic stability of a turbojet engine’s rotor based on complex coordinates formulation",
    "authors": "Çopur, F., Lotfan, S.",
    "cite": "7th Graduate Research Symposium, Gebze Technical University, Kocaeli, Turkey, 30-31 May 2023.",
    "abstract": "Rotor-bearing systems have a wide range of applications in many machines including jet engines, turbines, compressors, pumps, etc. Internal instability in these systems has been a well-known problem since the early days of turbomachinery. Rotordynamic instability is generally observed as sub-synchronous vibrations above the first critical speed of the rotor and cannot be improved with enhanced balancing. A rotor system must be free of destructive vibrations for safe operation. Therefore, accurate prediction of eigenvalues and related stability thresholds have critical importance for turbomachinery designers. Frictional joints and structural damping are the main sources of internal instability, that will produce a damping force in the rotating reference frame. Speed dependent instability terms are introduced to the equation of the motion when these damping forces are transformed from rotating reference frame to stationary reference frame. Accurate implementation of rotating damping is a controversial topic in rotordynamic literature and even some of the commonly used commercial software predicts erroneous results. In this study, equations governing the dynamics of the rotor of a turbojet engine are obtained based on a Timoshenko beam model. Rotating viscous and structural damping are properly incorporated into rotordynamic governing equations. The formulation is based on complex coordinates which allow accurate calculation of structural damping forces. Equations of motion with viscous and structural rotating damping are provided for both rotors on isotropic and anisotropic supports. Then, by providing the discretized equations based on finite element method, stability thresholds are calculated. Results are compared with the literature to show accurate implementation of rotating damping with complex vectors. The destabilizing effect of rotating structural damping is shown by analytical results. Additionally, results of isotropic and anisotropic supports are compared to show positive effects of support asymmetry on rotor stability.",
    "image": "PublicationPage/Rotor-Furkan-Lotfan-2023.png",
    "doi": "https://www.gtu.edu.tr/fileman/Files/UserFiles/fbe/Sempozyum2023/files/basic-html/page83.html"
  },
{
    "type": "Journal",
    "title": "Free vibrations of rotating pre-twisted blades including geometrically nonlinear pre-stressed analysis",
    "authors": "Lotfan, S., Bediz, B.",
    "cite": "Journal of Sound and Vibration, 535, pp.117109, 2022.",
    "abstract": "The steady-state equilibrium deformations (SSEDs) caused by centrifugal force field in rotating blades are not necessarily perturbed disturbances. These deformations can be considered as large amplitude deformations, especially for high values of the rotating speed. Accordingly, in the current study, geometrically nonlinear terms are included in the static analysis under centrifugal forces (SACF) to accurately model the stiffening/softening effects in the vibrations of rotating pre-twisted blades. To this end, by developing a shell model based on first-order shear deformation theory (FSDT), nonlinear and linear integral boundary value problems (IBVPs) governing the SSEDs and vibrations of the blade are obtained, respectively. Multi-mode discretization of these IBVPs is carried out by the spectral Chebyshev technique. The discretization of the nonlinear IBVP results in nonlinear algebraic equations. By solving these equations, nonlinear pre-stressed analysis (NPA) is performed to achieve the SACF. Then, the free vibrations of the rotating pre-twisted blade about the determined equilibrium position is investigated. The numerical results show that the natural frequencies obtained in the presence of the nonlinear terms are extremely lower than those of the linear pre-stressed analysis.}",
    "image": "PublicationPage/Freevib-2022.svg",
    "doi": "https://doi.org/10.1016/j.jsv.2022.117109"
  },
{
    "type": "Journal",
    "title": "Nonlinear resonances of axially functionally graded beams rotating with varying speed including Coriolis effects",
    "authors": "Lotfan, S., Anamagh, M.R., Bediz, B. and Ciğeroğlu, E.",
    "cite": "Nonlinear Dynamics, 107, pp.533-558, 2022.",
    "abstract": "The purpose of the current study was to develop an accurate model to investigate the nonlinear resonances in an axially functionally graded beam rotating with time-dependent speed. To this end, two important features including stiffening and Coriolis effects are modeled based on nonlinear strain relations. Equations governing the axial, chordwise, and flapwise deformations about the determined steady-state equilibrium position are obtained, and the rotating speed variation is considered as a periodic disturbance about this equilibrium condition. Multi-mode discretization of the equations is performed via the spectral Chebyshev approach and the method of multiple scales for gyroscopic systems is employed to study the nonlinear behavior. After determining the required polynomial number based on convergence analysis, results obtained are verified by comparing to those found in literature and numerical simulations. Moreover, the model is validated based on simulations carried out by commercial finite element software. Properties of the functionally graded material and the values of average rotating speed leading to 2:1 internal resonance in the system are found. Time and steady-state responses of the system under primary and parametric resonances caused by the time-dependent rotating speed are investigated when the system is tuned to 2:1 internal resonance. A comprehensive study on the time response, frequency response, and stability behavior shows that the rotating axially functionally graded beam exhibits a complicated nonlinear behavior under the effect of the rotating speed fluctuation frequency, damping coefficient, and properties of the functionally graded material.",
    "image": "PublicationPage/Rotating FGM Beam.svg",
    "doi": "https://doi.org/10.1007/s11071-021-07055-1"
  },
{
    "type": "Journal",
    "title": "A general higher-order model for vibration analysis of axially moving doubly-curved panels/shells",
    "authors": "Lotfan, S., Anamagh, M.R. and Bediz, B.",
    "cite": "Thin-Walled Structures, 164, pp.107813, 2021.",
    "abstract": "In this research a general model to study the vibration behavior of axially moving two-dimensional continuums in the presence of curvature along the moving axis is developed. To this end, an axially moving doubly-curved panel of variable radius of curvature is considered. The integral boundary value problem is obtained based on a higher-order shear deformation with first-order thickness stretching theory. Due to its high accuracy and computational performance, spectral Chebyshev approach is used to numerically solve the boundary value problem. Considering the geometry capabilities of the developed model, dynamics of various axially moving structures such as flat, singly- and doubly-curved plates/shells in different engineering applications with different boundary conditions can be investigated. The numerical results confirmed that the calculated natural frequencies for axially moving flat plates and circular cylindrical shells are in excellent agreement to those found in the literature and obtained via finite element approach. Furthermore, the effects of the axial velocity, thickness stretching, curvature ratio, and boundary conditions on the natural frequencies and stability behavior of the doubly-curved panels are investigated.",
    "image": "PublicationPage/Shells-TWST-Lotfan-2021.png",
    "doi": "https://doi.org/10.1016/j.tws.2021.107813"
  },
{
    "type": "Journal",
    "title": "Dynamics of carbon nanotubes under thermally induced nanoparticle transport on helical tracks",
    "authors": "Lotfan, S., Biglari, H. Choupani, A. and Bediz, B.",
    "cite": "Applied Mathematical Modelling, 93, pp.684-707, 2021.",
    "abstract": "The mechanism of nanoparticle transport inside carbon nanotubes is taken into account to investigate the dynamics of single-walled carbon nanotubes carrying a nanoparticle. The motion of the nanoparticle is on helical tracks, which is induced by temperature difference in the nanotube, with main characteristics such as axial, and angular velocities and pitch angle. The helical motion is modeled based on constrained and unconstrained simulations. In the case of the former, the axial velocity is constant, however, in the latter simulation, the axial velocity is time-variant and stop-and-go events with simultaneous changes in the rotation direction are considered as random uncertainty in the system. Once the helical motion is clarified, the dynamic behavior of the nanotube acted upon by a moving nanoparticle is investigated for simply supported boundary conditions and stability analysis is performed to obtain the critical velocities as well as critical temperature differences based on Floquet theorem. For the case of the system with random uncertainty, the statistical properties as well as confidence and prediction intervals of the dynamic response are also studied by Monte-Carlo simulation. The results highlight the importance of the helical motion mechanism of the moving nanoparticle and the random uncertainty in the system.",
    "image": "PublicationPage/Nanotube-AMM-Lotfan-2021.png",
    "doi": "https://doi.org/10.1016/j.apm.2020.12.037"
  },
{
    "type": "Journal",
    "title": "Nonlinear Vibration and Stability Analysis of Viscoelastic Rayleigh Beams Axially Moving on a Flexible Intermediate Support",
    "authors": "Farshbaf Zinati, R., Rezaee, M. and Lotfan, S.",
    "cite": "Iranian Journal of Science and Technology, Transactions of Mechanical Engineering, 44, pp.865-879, 2020.",
    "abstract": "In this study, the nonlinear vibration and stability of a simply supported axially moving Rayleigh viscoelastic beam equipped with an intermediate nonlinear support are investigated. The type of considered nonlinearity is geometric and is due to the axial stretching. The Kelvin–Voigt model is used to regard the beam internal damping. The Hamilton’s principle is employed to derive the governing equations and corresponding boundary conditions. The multiple scales method is applied to the dimensionless form of the governing equations and the nonlinear frequencies, time response of the system for two cases of the axial velocity fluctuation frequency are obtained. The stability of the system is investigated via solvability condition and Routh–Hurwitz criterion. Some case studies are accomplished to demonstrate the effect of rotary inertia, axial velocity and parameters of intermediate support on the system response, critical velocity and the system stability. Furthermore, the variation of the first two resonance frequencies with respect to mean axial velocities for different locations of the intermediate support are investigated. It is found that by moving the intermediate support from one end of the beam to its midpoint, the region in which the first mode undergoes static instability, shrinks. Moreover, although rotary inertia impressively decreases the natural frequencies, intermediate support has the dominant effect on increasing the natural frequencies.",
    "image": "PublicationPage/AxiallyMoving-I-Lotfan-2020.png",
    "doi": "https://doi.org/10.1007/s40997-019-00305-z"
  },
{
    "type": "Journal",
    "title": "A new approach for optimization of combined cycle system based on first level of exergy destruction splitting",
    "authors": "Ghiasi, R.A., Fallah, M., Lotfan, S. and Rosen, M.A.",
    "cite": "Sustainable Energy Technologies and Assessments, 37, pp.100600, 2020.",
    "abstract": "A multi-objective optimization of a combined air cooled gas turbine and steam turbine system is carried out using non-dominated sorting genetic algorithm II (NSGA-II). In the optimization process, performance and environmental aspects of the system are considered and the first level of exergy destruction splitting is incorporated. Such parameters as second law efficiency, ratio of total avoidable exergy destruction rate to total exergy destruction rate and CO2 emission in exhaust gases, are considered as the objective functions. Once the model of the system is constructed in engineering equation solver (EES) software and validated, the gas turbine inlet temperature and compressor pressure ratio are considered as the decision variables based on the performed sensitivity analysis. Then, EES is coupled with MATLAB and the multi-objective optimization is performed for various values of gas turbine blade cooling air fractions. By comparing the obtained Pareto optimal points with those of the base case, considerable improvements in the values of the objective functions are observed.",
    "image": "PublicationPage/Optimization-SETA-Lotfan-2020.png",
    "doi": "https://doi.org/10.1016/j.seta.2019.100600"
  },
{
    "type": "Journal",
    "title": "Experimental study on the effect of excitation type on the output-only modal analysis results",
    "authors": "Varahram, S., Jalali, P., Sadeghi. M.H. and Lotfan, S.",
    "cite": "Transactions of FAMENA, 43(3), pp.37-52, 2019.",
    "abstract": "Output-only Modal Analysis (OMA) has found extensive use in the identification of dynamic properties of structures. This study aims to investigate the effect of excitation force on the accuracy of modal parameters. For this purpose, the modal parameters of a simply supported beam are obtained through the Experimental Modal Analysis (EMA) and the OMA method using three different types of artificial and natural excitations, namely a shaker, acoustic waves and environmental noise. Frequency Domain Decomposition (FDD) technique is used to identify dynamic characteristics. Finally, these results are compared with those obtained by the analytical method and the EMA method. The results demonstrated the following: 1) Acoustic excitation presents the natural frequencies with the smallest errors in comparison with the analytical results. 2) Inaccuracy is observed at certain natural frequencies during the excitation with a shaker with respect to the connecting point between the shaker and the beam. 3) Modal Assurance Criterion (MAC) showed that the mode shapes extracted by the acoustic excitations are more similar to the analytical results.",
    "image": "PublicationPage/Modal-Famena-Lotfan-2019.png",
    "doi": "https://doi.org/10.21278/TOF.43303"
  },
{
    "type": "Journal",
    "title": "Identification of nonlinear modal interactions in a beam-mass-spring-damper system based on mono-frequency vibration response",
    "authors": "Sadeghi, M.H., Lotfan, S.",
    "cite": "Journal of Computational Methods in Engineering (in Persian, National Journal), 38(1), pp.19-36, 2019.",
    "abstract": "In this paper, nonlinear modal interactions caused by one-to-three internal resonance in a beam-mass-spring-damper system are investigated based on nonlinear system identification. For this purpose, the equations governing the transverse vibrations of the beam and mass are analyzed via the multiple scale method and the vibration response of the system under primary resonance is extracted. Then, the frequency behavior of the vibration response is studied by Fourier and Morlet wavelet transforms. In order to perform the nonparametric identification of the time response, mono-frequency intrinsic mode functions are derived by the advanced empirical mode decomposition. In this approach, masking signals are utilized in order to avoid mode mixing caused by modal interaction. After analyzing the frequency behavior of each mode function, slow flow dynamics of the system is established and intrinsic modal oscillators for reconstructing the corresponding intrinsic mode are extracted. Finally, by analyzing the beating phenomenon in a simple one-degree-of-freedom system, it is shown that the internal resonance causes beating only under the circumstance that the slope of the logarithmic amplitude of oscillator force is nonzero. The results, therefore, show that depending on the periodic, pseudo-periodic and chaotic behavior of the response, modal interactions might be stationary or non-stationary. Moreover, the chaotic behavior occurs mostly in the vibration mode excited by the internal resonance mechanism.",
    "image": "PublicationPage/Modal-JCME-Lotfan-2019.png",
    "doi": "https://jcme.iut.ac.ir/article_3188.html?lang=en"
  },
  {
    "type": "Journal",
    "title": "Support vector machine classification of brain states exposed to social stress test using EEG-based brain network measures",
    "authors": "Lotfan, S., Shahyad, S., Khosrowabadi, R., Mohammadi, A. and Hatef, B.",
    "cite": "Biocybernetics and Biomedical Engineering, 39(1), pp.199-213, 2019.",
    "abstract": "Stress is one of the most significant health problems in the 21st century and should be dealt with due to the costs of primary and secondary cares of stress-associated psychological and psychiatric problems. In this study, the brain network states exposed to stress were monitored based on electroencephalography (EEG) measures extracted by complex network analysis. To this regard, 23 healthy male participants aged 18–28 were exposed to a stress test. EEG data and salivary cortisol level were recorded for three different conditions including before, right after and 20 min after exposure to stress. Then, synchronization likelihood (SL) was calculated for the set of EEG data to construct complex networks, which are scale reduced datasets acquired from multi-channel signals. These networks with weighted connectivity matrices were constructed based on original EEG data and also by using four different waves of the recorded signals including δ, θ, α and β. In addition to these networks with weighted connectivity, networks with binary connectivity matrices were also derived using threshold T. For each constructed network, four measures including transitivity, modularity, characteristic path length and global efficiency were calculated. To select the sensitive optimal features from the set of the calculated measures, compensation distance evaluation technique (CDET) was applied. Finally, multi-class support vector machine (SVM) was trained in order to classify the brain network states. The results of testing the SVM models showed that the features based on the original EEG, α and β waves have got better performances in monitoring the brain network states.",
    "image": "PublicationPage/SVM-Bio-Lotfan-2019.png",
    "doi": "https://doi.org/10.1016/j.bbe.2018.10.008"
  },
{
    "type": "Journal",
    "title": "Cavitation intensity monitoring in an axial flow pump based on vibration signals using multi-class support vector machine",
    "authors": "Shervani-Tabar M.T., Ettefagh, M.M., Lotfan, S. and Safarzadeh, H.",
    "cite": "Proceedings of the Institution of Mechanical Engineers, Part C., 232(17), pp.3013-3026, 2017.",
    "abstract": "The cavitation phenomenon, which is rampant in axial flow pumps, should be avoided due to its undesirable effects on the pump’s performance. Therefore, in this study the cavitation performance of an axial flow pump is monitored based on vibration signals. For this purpose, experimental vibration data is collected for five different levels of cavitation. Time-domain features are extracted based on statistical behavior of the measured signals. Considering the nonlinear and high-frequency nature of the cavitation noise in the signal, the second set of features including both time- and frequency-domain parameters are obtained based on statistical behavior of the first intrinsic mode function, via empirical mode decomposition combined with Hilbert Huang transform. Compensation distance evaluation technique is applied to pick the appropriate features. Multi-class support vector machine is trained for classification of the various levels of cavitation intensity. The results of testing the support vector machine algorithm show that the developed methodology can monitor the pump’s cavitation intensity in onsite operation with high accuracy.",
    "image": "PublicationPage/Cavitation-PartC-Lotfan-2017.png",
    "doi": "https://doi.org/10.1177/0954406217729416"
  },
{
    "type": "Journal",
    "title": "Parametric modeling of carbon nanotubes and estimating nonlocal constant using simulated vibration signals-ARMA and ANN based approach",
    "authors": "Lotfan, S., Fathi, R.",
    "cite": "Journal of Central South University, 25, pp.461-472, 2018.",
    "abstract": "Nonlocal continuum mechanics is a popular growing theory for investigating the dynamic behavior of Carbon nanotubes (CNTs). Estimating the nonlocal constant is a crucial step in mathematical modeling of CNTs vibration behavior based on this theory. Accordingly, in this study a vibration-based nonlocal parameter estimation technique, which can be competitive because of its lower instrumentation and data analysis costs, is proposed. To this end, the nonlocal models of the CNT by using the linear and nonlinear theories are established. Then, time response of the CNT to impulsive force is derived by solving the governing equations numerically. By using these time responses the parametric model of the CNT is constructed via the autoregressive moving average (ARMA) method. The appropriate ARMA parameters, which are chosen by an introduced feature reduction technique, are considered features to identify the value of the nonlocal constant. In this regard, a multi-layer perceptron (MLP) network has been trained to construct the complex relation between the ARMA parameters and the nonlocal constant. After training the MLP, based on the assumed linear and nonlinear models, the ability of the proposed method is evaluated and it is shown that the nonlocal parameter can be estimated with high accuracy in the presence/absence of nonlinearity.",
    "image": "PublicationPage/Prametric-JCSU-Lotfan-2018.png",
    "doi": "https://doi.org/10.1007/s11771-018-3750-7"
  },
{
    "type": "Journal",
    "title": "Identification of non-linear parameter of a cantilever beam model with boundary condition non-linearity in the presence of noise: an NSI- and ANN-based approach",
    "authors": "Sadeghi, M.H., Lotfan, S.",
    "cite": "Acta Mechanica, 228, pp.4451-4469, 2017.",
    "abstract": "In this study the non-linear system identification (NSI) and parameter estimation of a model of a cantilever beam with non-linear stiffness attached to its free end are investigated. For this purpose, the impulse response of the beam model, in the presence of added measurement noise, is obtained by solving the weak form of the governing equation of motion via Rayleigh–Ritz method. The non-linear interaction model (NIM) including a set of intrinsic modal oscillators (IMOs) is constructed based on intrinsic mode functions (IMFs), which are derived by applying empirical mode decomposition (EMD) on the noise-contaminated response signals. For reducing the effect of noise and increasing the accuracy of extracted IMFs, the EMD-based noise reduction is employed, followed by the modification of the IMF amplitudes by introducing a “beta-factor” criterion. The changes in the amplitudes of the forcing functions associated with IMOs are used to extract features to estimate the non-linear parameter of the system. To this end, an artificial neural network has been trained to establish the non-linear relationship between the non-linearity of the system and the forcing functions of IMOs.",
    "image": "PublicationPage/Identification-ActaMechanica-Lotfan-2017.png",
    "doi": "https://doi.org/10.1007/s00707-017-1947-8"
  },
{
    "type": "Journal",
    "title": "Large amplitude free vibration of a viscoelastic beam carrying a lumped mass–spring–damper",
    "authors": "Lotfan, S., Sadeghi, M.H.",
    "cite": "Nonlinear Dynamics, 90, pp.1053-1075, 2017.",
    "abstract": "Numerous engineering structures can be modeled as flexible beams carrying appendages. Physical time-dependent phenomena in such structures appear by considering nonlinear models. Accordingly, the free vibration of a nonlinear Rayleigh beam carrying a linear mass–spring–damper is investigated in this research. The nonlinearity is due to the axial stress changes and the viscoelastic characteristic of the beam is described by the Kelvin–Voigt model. The governing nonlinear equations of motion are derived by using Hamilton’s principle and solved by the multiple scales method. The presence of the linear damper in the mass–spring–damper system causes a contradiction in the time response of the mass obtained from the classical procedure of the multiple scales method. Therefore, the problem is solved by some manipulations in the process of the multiple scales method. Then, the complex-valued resonance frequencies and mode-shapes are derived by applying the method of power series with the aid of Green function concept. Considering the solvability condition, the nonlinear time-dependent resonance frequencies and the vibration response are obtained. The stability of the solution is studied by using the forward and pullback attractor ideas. Finally, the vibration of the system involving 3:1 internal resonance is investigated and the stability boundaries of the trivial and non-trivial steady-state solutions are derived based on Lyapunov’s first method. It is shown that the main parameters of the MSD can provide 3:1 internal resonance condition.",
    "image": "PublicationPage/Large-amplitude-NODY-Lotfan-2017.png",
    "doi": "https://doi.org/10.1007/s11071-017-3710-z"
  },
{
    "type": "Journal",
    "title": "Stability and bifurcation analysis of a beam-mass-spring-damper system under primary and one-to-three internal resonances",
    "authors": "Sadeghi, M.H., Lotfan, S.",
    "cite": "Modares Mechanical Engineering (in Persian, National Journal), 17(2), pp.166-176, 2015.",
    "abstract": "In this paper nonlinear modal interactions and stability of a Rayleigh beam carrying a mass-springdamper system are investigated. For this purpose, the dimensionless equations governing the vibration of the system are analyzed based on multiple scales method. By considering viscoelastic Kelvin-Voigt damping in the beam, complex mode shapes and time-dependent resonance frequencies are extracted. Using the traditional form of the multiple scales method results in physical contradiction in the time response of the concentrated mass, which should be resolved. After free vibration analysis, the forced response of the system under harmonic force with frequency close to the first natural frequency and occurrence of one-to-three internal resonance is studied. The parameters of the one degree of freedom system are considered in a way that the modal interaction occurs via internal resonance mechanism. In this condition, frequency response of the system and its stability are investigated and it is shown that the instability associated with the jump and Hopf bifurcation occurs in the vibration amplitude. Plots of the time response, phase and Poincare show that periodic, quasi-periodic and chaotic vibration may take place in the system. In order to verify the present paper’s results, the natural frequencies of the system are compared to those of the previous studies; in addition to this comparison, the frequency response based on numerical integration validates the results of the present paper.",
    "image": "PublicationPage/Stability-MME-Lotfan-2015.png",
    "doi": "https://mme.modares.ac.ir/article-15-154-en.pdf"
  },  
{
    "type": "Journal",
    "title": "Influence of imperfect end boundary condition on the nonlocal dynamics of CNTs",
    "authors": "Fathi, R., Lotfan, S. and Sadeghi, M.H.",
    "cite": "Mechanical Systems and Signal Processing, 87, pp.124-135, 2017.",
    "abstract": "Imperfections that unavoidably occur during the fabrication process of carbon nanotubes (CNTs) have a significant influence on the vibration behavior of CNTs. Among these imperfections, the boundary condition defect is studied in this investigation based on the nonlocal elasticity theory. To this end, a mathematical model of the non-ideal end condition in a cantilever CNT is developed by a strongly non-linear spring to study its effect on the vibration behavior. The weak form equation of motion is derived via Hamilton’s principle and solved based on Rayleigh–Ritz approach. Once the frequency response function (FRF) of the CNT is simulated, it is found that the defect parameter injects noise to the FRF in the range of lower frequencies and as a result the small scale effect on the FRF remains undisturbed in high frequency ranges. Besides, in this work a process is introduced to estimate the nonlocal and defect parameters for establishing the mathematical model of the CNT based on FRF, which can be competitive because of its lower instrumentation and data analysis costs. The estimation process relies on the resonance frequencies and the magnitude of noise in the frequency response function of the CNT. The results show that the constructed dynamic response of the system based on estimated parameters is in good agreement with the original response of the CNT.",
    "image": "PublicationPage/Imperfect-MSSP-Lotfan-2017.png",
    "doi": "https://doi.org/10.1016/j.ymssp.2016.10.015"
  },
{
    "type": "Journal",
    "title": "Nonparametric system identification of a cantilever beam model with local nonlinearity in the presence of artificial noise",
    "authors": "Sadeghi, M.H., Lotfan, S.",
    "cite": "Modares Mechanical Engineering (in Persian, National Journal), 16(11), pp.177-186, 2016.",
    "abstract": "In this paper the effect of artificial noise on the performance of nonlinear system identification method in reconstructing the response of a cantilever beam model having local nonlinearity is investigated. For this purpose, the weak form equation governing the transverse vibration of a linear beam having a strongly nonlinear spring at the end is discretized by using Rayleigh-Ritz approach. Then, the derived equations are solved via Rung-Kutta method and the simulated response of the beam to impulse force is obtained. By contaminating the simulated response to artificial measurement noise, nonparametric nonlinear system identification is applied to reconstruct the response. Accordingly, intrinsic mode functions of the response are obtained by using advanced empirical mode decomposition and nonlinear interaction model including intrinsic modal oscillators is constructed. Primary results show that the presence of noise in the response highly affects the sifting process which results in extraction of spurious intrinsic mode functions. In order to eradicate the effect of noise on this process, noise signals are used as masking signals in the advanced empirical mode decomposition method and intrinsic mode functions corresponding to the noise are extracted. Based on this approach, the dynamic of the noise in the response is identified and noise reduced signals are reconstructed by the intrinsic modal oscillators with suitable accuracy.",
    "image": "PublicationPage/Nonparametric-MME-Lotfan-2016.png",
    "doi": "https://www.researchgate.net/profile/Saeed-Lotfan/publication/311674834_Nonparametric_system_identification_of_a_cantilever_beam_model_with_local_nonlinearity_in_the_presence_of_artificial_noise_In_Persian/links/5853bbe408ae0c0f322425b9/Nonparametric-system-identification-of-a-cantilever-beam-model-with-local-nonlinearity-in-the-presence-of-artificial-noise-In-Persian.pdf"
  },  
{
    "type": "Journal",
    "title": "Size-dependent nonlinear vibration analysis of carbon nanotubes conveying multiphase flow",
    "authors": "Lotfan, S., Fathi, R. and Ettefagh, M.M.",
    "cite": "International Journal of Mechanical Sciences, 115-116, pp.723-735, 2016.",
    "abstract": "An understanding of the dynamic behavior of the carbon nanotubes (CNTs) conveying fluid is very important for exploring the applications in nanoscale systems. Due to the molecular network disruption, the passing flow has multiphase nature. In this regard, the nonlinear vibration behavior of the CNT conveying multiphase flow is investigated by considering the small scale effects based on the nonlocal theory. The effect of the multiphase flow on the CNT's vibration behavior is modeled by the resultant random uncertainty in the external excitation along with considering the slip flow velocity profile. After extraction of the governing equation by implementing Hamilton's principle and discretizing it by the Galerkin method, the resulting equations are solved numerically. Due to the stochastic nature of the differential equations, the statistical parameters of the response have been obtained by Monte–Carlo simulation. By studying the deflection of the midpoint of the CNT and also considering corresponding upper and lower limit band (confidence interval), extended results of uncertainty effects have been obtained. Moreover the effect of nonlocal parameter, flow velocity and Knudsen number on the statistical dynamic behavior of the system have been investigated. The results show that as the molecular behavior of the flow increases the uncertainty in the system and the confidence interval increase.",
    "image": "PublicationPage/Size-dependent-IJMS-Lotfan-2016.png",
    "doi": "https://doi.org/10.1016/j.ijmecsci.2016.07.034"
  },
  {
    "type": "Journal",
    "title": "The effect of calibrated nonlocal constant on the modal parameters and stability of axially compressed CNTs",
    "authors": "Fathi, R., Lotfan, S.",
    "cite": "Physica E: Low-dimensional Systems and Nanostructures, 79, pp.139-146, 2016.",
    "abstract": "Nowadays investigating the vibration behavior of carbon nanotubes (CNTs) has drawn considerable attention due to the superior mechanical properties of the CNTs. One of the powerful theoretical methods to study the vibration behavior of CNTs is implementing the nonlocal theory. Most of studies on the vibration behavior of CNTs have assumed a fixed value for small scale parameter for all vibration modes, however, this value is mode-dependent. Therefore, in this paper, the small scale parameter is calibrated for a single-walled carbon nanotube (SWCNT) with respect to each vibration mode. For this propose, the governing equation of motion based on the nonlocal beam theory is extracted by applying the Hamilton's principle. Then, by using the power series method, an eigenvalue problem is defined to derive the calibrated value of small scale constant and nonlocal mode shapes of the CNT. By using the expansion theory, the equation of motion is discretized and the effect of nonlocality on the modal parameters and stability of the CNT under compressive force is investigated. Finally, the possibility of estimating nonlocal parameter based on simulated frequency domain response of the system by using modal analysis methods is studied. The results show that the calibration of small scale constant is important and the critical axial force is highly sensitive to this value.",
    "image": "PublicationPage/Calibrated-PhysicaE-Lotfan-2016.png",
    "doi": "https://doi.org/10.1016/j.physe.2015.12.032"
  },
{
    "type": "Journal",
    "title": "Nonlinear vibration and stability of carbon nanotube conveying fluid embedded in elastic medium",
    "authors": "Rezaee, M., Lotfan, S.",
    "cite": "Iranian Journal of Mechanical Engineering Transactions of ISME (in Persian, National Journal), 17(3), pp.27-48, 2015.",
    "abstract": "In the present study, considering the geometric nonlinearity, the nonlinear vibration behavior of a carbon nanotube conveying fluid embedded in an elastic medium is studied. The fluid passing through the nanotube is considered to be inviscid and incompressible. Using the Rayleigh’s elastic theory, the governing equation of motion is derived. By considering a suitable parameter, the governing equation is converted to a form which can be solved by the perturbation method. Applying the Lindstedt-Poincare’ method, the time response, the nonlinear resonance frequencies and the fluid critical velocity of the nanotube are obtained. The accuracy of the results is investigated by comparing them with those obtained through the numerical method. Unlike previous researches, the analytical relation for the fluid critical velocity is obtained considering the effect of the geometric nonlinearity. The results indicate that, as the fluid velocity increases and reaches a critical value, the time response amplitude grows without limit and the nanotube loses stability. Moreover, in comparison with the linear and small-amplitude vibrations of nanotube, by increasing the amplitude of oscillations, nonlinear behavior dominates and the instability occurs at a higher fluid velocity.",
    "image": "PublicationPage/Nanotube-IJMET-Lotfan-2015.png",
    "doi": "https://dor.isc.ac/dor/20.1001.1.25384775.1394.17.3.2.3"
  },
 {
    "type": "Journal",
    "title": "Statistical analysis of random uncertainty in the pipes conveying multi-phase flow based on nonlinear dynamic model",
    "authors": "Fathi, R., Lotfan, S. and Ettefagh, M.M.",
    "cite": "Modares Mechanical Engineering (in Persian, National Journal), 15(8), pp.323-331, 2015.",
    "abstract": "There are many researches on the vibration behavior of the multi-phase flow in the pipes. However, there isn’t any general statistical study on the dynamic response of such systems. Therefore in this paper, at the first step, the nonlinear equation governing the transverse vibration of the pipe is derived using the Hamilton's principle. The nonlinearity in the system is induced by considering large deflections. The interaction between the pipe and the multi-phase fluid flow and the resultant uncertainty is modeled by random excitation which is produced by using normal distribution function. After extraction of the governing equation and discretizing it by the Galerkin method, the equations are solved numerically. The statistical parameters of the response have been extracted by Monte-Carlo simulation. With studying on the deflection of one point on the pipe and also considering corresponding upper and lower limit band (confidence interval), extended results of uncertainties effects have been obtained. The results show that with increasing the velocity of the fluid, the uncertainty of the response is decreasing. Also by considering nonlinear model, the probabilities of failure are increased.",
    "image": "PublicationPage/Statistical-MME-Lotfan-2015.png",
    "doi": "http://mme.modares.ac.ir/article-15-8669-en.html"
  },
  {
    "type": "Journal",
    "title": "Non-linear nonlocal vibration and stability analysis of axially moving nanoscale beams with time-dependent velocity",
    "authors": "Rezaee, M., Lotfan, S.",
    "cite": "International Journal of Mechanical Sciences, 96-97, pp.36-46, 2015.",
    "abstract": "The extraordinary properties of carbon nanotubes enable a variety of applications such as axially moving elements in nanoscale systems. For vibration analysis of axially moving nanoscale beams with time-dependent velocity, the small-scale effects could make considerable changes in the vibration behavior. In this research, by applying the nonlocal theory and considering small fluctuations in the axial velocity, the stability and non-linear vibrations of an axially moving nanoscale visco-elastic Rayleigh beam are studied. It is assumed that the non-linearity is geometric and is due to the axial stress changes. The energy loss in the system is considered by using the Kelvin–Voigt model. The governing higher order nonlocal equation of motion is derived by using Hamilton׳s principle and is analyzed by applying the multiple scales and power series methods. Then the non-linear resonance frequencies and response of the system are obtained. Considering the solvability condition, the stability of the system is studied parametrically through Lyapunov׳s first method. An interesting result is that, considering the small-scale effects changes the slope of the frequency response curves due to the fluctuations in the axial velocity, considerably.",
    "image": "PublicationPage/Nonlinear-IJMS-Lotfan-2015.png",
    "doi": "https://doi.org/10.1016/j.ijmecsci.2015.03.017"
  },
  {
    "type": "Journal",
    "title": "ANN-based modeling and reducing dual-fuel engine’s challenging emissions by multi-objective evolutionary algorithm NSGA-II",
    "authors": "Lotfan, S., Ghiasi, R.A., Fallah, M. and Sadeghi, M.H.",
    "cite": "Applied Energy, 175, pp.91–99, 2016.",
    "abstract": "In this study, the combination of artificial neural network (ANN) and non-dominated sorting genetic algorithm II (NSGA-II) has been implemented for modeling and reducing CO and NOx emissions from a direct injection dual-fuel engine. A multi-layer perceptron (MLP) network is developed to predict the values of the emissions based on experimental data. The controllable variables such as engine speed, output power, intake temperature, mass flow rate of diesel fuel and mass flow rate of the gaseous fuel are considered as input parameters. In order to identify the uncertainties due to the experiments and the ANN-based model, uncertainty analysis is carried out. Finally, optimum values of intake temperature, mass flow rate of diesel and gaseous fuels are obtained for a desired output power and engine speed via NSGA-II. The use of the developed evolutionary optimization algorithm allows the calculation of the Pareto-optimal set of designs under any combination of engine speed and output power, defined in the range of the experiments.",
    "image": "PublicationPage/ANN-Applied Energy-2016.png",
    "doi": "https://doi.org/10.1016/j.apenergy.2016.04.099"
  },
  {
    "type": "Conference",
    "title": "Bearing fault detection using fuzzy C-means and hybrid C-means-subtractive algorithms",
    "authors": "Lotfan, S., Salehpour, N., Adiban, H. and Mashroutechi, A.",
    "cite": "2015 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE), Istanbul, Turkey, pp.1-7, 02-05 August 2015.",
    "abstract": "In this research, ball bearing fault diagnosis based on experimental vibration signals is studied. For this purpose, vibration signals are measured by an acceleration sensor from undamaged and damaged ball bearings. By estimating the power spectral density, frequency-domain transform signals are obtained. The locus of the first four extremes of the frequency-domain signals are used as visual patterns for fault detection. The features for detection of bearing faults are extracted from the extremes of the training signals based on proposed clustering algorithms. In line with the conventional fuzzy C-means (FCM) clustering method, we have proposed the improved fuzzy clustering technique based on heuristic subtractive approach. While the FCM suffers from the convergence and efficiency, the hybrid C-means-Subtractive (FCM-S) clustering benefits from the optimal initial point selection that highly improves its performance and convergence. Not only the experimental results for different test signal scenarios show that the proposed FCM-S clustering approach outperforms the conventional FCM method, but also the FCM-S detects the bearing faults better than the previous ones.",
    "image": "PublicationPage/Bearing-IEEE-Lotfan-2015.png",
    "doi": "https://doi.org/10.1109/FUZZ-IEEE.2015.7338049"
  }
]
