[
  {
    "type": "Journal",
    "title": "",
    "authors": "",
    "cite": "",
    "abstract": "",
    "image": "",
    "doi": ""
  },
  {
    "type": "Journal",
    "title": "The effect of calibrated nonlocal constant on the modal parameters and stability of axially compressed CNTs",
    "authors": "Fathi, R., and Lotfan, S.",
    "cite": "Physica E: Low-dimensional Systems and Nanostructures, 79, pp.139-146, 2016.",
    "abstract": "Nowadays investigating the vibration behavior of carbon nanotubes (CNTs) has drawn considerable attention due to the superior mechanical properties of the CNTs. One of the powerful theoretical methods to study the vibration behavior of CNTs is implementing the nonlocal theory. Most of studies on the vibration behavior of CNTs have assumed a fixed value for small scale parameter for all vibration modes, however, this value is mode-dependent. Therefore, in this paper, the small scale parameter is calibrated for a single-walled carbon nanotube (SWCNT) with respect to each vibration mode. For this propose, the governing equation of motion based on the nonlocal beam theory is extracted by applying the Hamilton's principle. Then, by using the power series method, an eigenvalue problem is defined to derive the calibrated value of small scale constant and nonlocal mode shapes of the CNT. By using the expansion theory, the equation of motion is discretized, and the effect of nonlocality on the modal parameters and stability of the CNT under compressive force is investigated. Finally, the possibility of estimating nonlocal parameter based on simulated frequency domain response of the system by using modal analysis methods is studied. The results show that the calibration of small scale constant is important and the critical axial force is highly sensitive to this value.",
    "image": "PublicationPage/Calibrated-PhysicaE-Lotfan-2016.png",
    "doi": "https://doi.org/10.1016/j.physe.2015.12.032"
  },
{
    "type": "Journal",
    "title": "Nonlinear vibration and stability of carbon nanotube conveying fluid embedded in elastic medium",
    "authors": "Rezaee, M., and Lotfan, S.",
    "cite": "Iranian Journal of Mechanical Engineering Transactions of ISME (in Persian, National Journal), 17(3), pp.27-48, 2015.",
    "abstract": "In the present study, considering the geometric nonlinearity, the nonlinear vibration behavior of a carbon nanotube conveying fluid embedded in an elastic medium is studied. The fluid passing through the nanotube is considered to be inviscid and incompressible. Using the Rayleigh’s elastic theory, the governing equation of motion is derived. By considering a suitable parameter, the governing equation is converted to a form which can be solved by the perturbation method. Applying the Lindstedt-Poincare’ method, the time response, the nonlinear resonance frequencies and the fluid critical velocity of the nanotube are obtained. The accuracy of the results is investigated by comparing them with those obtained through the numerical method. Unlike previous researches, the analytical relation for the fluid critical velocity is obtained considering the effect of the geometric nonlinearity. The results indicate that, as the fluid velocity increases and reaches a critical value, the time response amplitude grows without limit and the nanotube loses stability. Moreover, in comparison with the linear and small-amplitude vibrations of nanotube, by increasing the amplitude of oscillations, nonlinear behavior dominates and the instability occurs at a higher fluid velocity.",
    "image": "PublicationPage/Nanotube-IJMET-Lotfan-2015.png",
    "doi": "https://dor.isc.ac/dor/20.1001.1.25384775.1394.17.3.2.3"
  },
 {
    "type": "Journal",
    "title": "Statistical analysis of random uncertainty in the pipes conveying multi-phase flow based on nonlinear dynamic model",
    "authors": "Fathi, R., Lotfan, S., and Ettefagh, M.M.",
    "cite": "Modares Mechanical Engineering (in Persian, National Journal), 15(8), pp.323-331, 2015.",
    "abstract": "There are many researches on the vibration behavior of the multi-phase flow in the pipes. However, there isn’t any general statistical study on the dynamic response of such systems. Therefore in this paper, at the first step, the nonlinear equation governing the transverse vibration of the pipe is derived using the Hamilton's principle. The nonlinearity in the system is induced by considering large deflections. The interaction between the pipe and the multi-phase fluid flow and the resultant uncertainty is modeled by random excitation which is produced by using normal distribution function. After extraction of the governing equation and discretizing it by the Galerkin method, the equations are solved numerically. The statistical parameters of the response have been extracted by Monte-Carlo simulation. With studying on the deflection of one point on the pipe and also considering corresponding upper and lower limit band (confidence interval), extended results of uncertainties effects have been obtained. The results show that with increasing the velocity of the fluid, the uncertainty of the response is decreasing. Also by considering nonlinear model, the probabilities of failure are increased.",
    "image": "PublicationPage/Statistical-MME-Lotfan-2015.png",
    "doi": "http://mme.modares.ac.ir/article-15-8669-en.html"
  },
  {
    "type": "Journal",
    "title": "Non-linear nonlocal vibration and stability analysis of axially moving nanoscale beams with time-dependent velocity",
    "authors": "Rezaee, M., and Lotfan, S.",
    "cite": "International Journal of Mechanical Sciences, 96-97, pp.36-46, 2015.",
    "abstract": "The extraordinary properties of carbon nanotubes enable a variety of applications such as axially moving elements in nanoscale systems. For vibration analysis of axially moving nanoscale beams with time-dependent velocity, the small-scale effects could make considerable changes in the vibration behavior. In this research, by applying the nonlocal theory and considering small fluctuations in the axial velocity, the stability and non-linear vibrations of an axially moving nanoscale visco-elastic Rayleigh beam are studied. It is assumed that the non-linearity is geometric and is due to the axial stress changes. The energy loss in the system is considered by using the Kelvin–Voigt model. The governing higher order nonlocal equation of motion is derived by using Hamilton׳s principle and is analyzed by applying the multiple scales and power series methods. Then the non-linear resonance frequencies and response of the system are obtained. Considering the solvability condition, the stability of the system is studied parametrically through Lyapunov׳s first method. An interesting result is that, considering the small-scale effects changes the slope of the frequency response curves due to the fluctuations in the axial velocity, considerably.",
    "image": "PublicationPage/Nonlinear-IJMS-Lotfan-2015.png",
    "doi": "https://doi.org/10.1016/j.ijmecsci.2015.03.017"
  },
  {
    "type": "Journal",
    "title": "ANN-based modeling and reducing dual-fuel engine’s challenging emissions by multi-objective evolutionary algorithm NSGA-II",
    "authors": "Lotfan, S., Ghiasi, R.A., Fallah, M., and Sadeghi, M.H.",
    "cite": "Applied Energy, 175, pp.91–99, 2016.",
    "abstract": "In this study, the combination of artificial neural network (ANN) and non-dominated sorting genetic algorithm II (NSGA-II) has been implemented for modeling and reducing CO and NOx emissions from a direct injection dual-fuel engine. A multi-layer perceptron (MLP) network is developed to predict the values of the emissions based on experimental data. The controllable variables such as engine speed, output power, intake temperature, mass flow rate of diesel fuel, and mass flow rate of the gaseous fuel are considered as input parameters. In order to identify the uncertainties due to the experiments and the ANN-based model, uncertainty analysis is carried out. Finally, optimum values of intake temperature, mass flow rate of diesel and gaseous fuels are obtained for a desired output power and engine speed via NSGA-II. The use of the developed evolutionary optimization algorithm allows the calculation of the Pareto-optimal set of designs under any combination of engine speed and output power, defined in the range of the experiments.",
    "image": "PublicationPage/ANN-Applied Energy-2016.png",
    "doi": "https://doi.org/10.1016/j.apenergy.2016.04.099"
  },
  {
    "type": "Conference",
    "title": "Bearing fault detection using fuzzy C-means and hybrid C-means-subtractive algorithms",
    "authors": "Lotfan, S., Salehpour, N., Adiban, H., and Mashroutechi, A.",
    "cite": "2015 IEEE International Conference on Fuzzy Systems (FUZZ-IEEE), Istanbul, Turkey, pp.1-7, 02-05 August 2015.",
    "abstract": "In this research, ball bearing fault diagnosis based on experimental vibration signals is studied. For this purpose, vibration signals are measured by an acceleration sensor from undamaged and damaged ball bearings. By estimating the power spectral density, frequency-domain transform signals are obtained. The locus of the first four extremes of the frequency-domain signals are used as visual patterns for fault detection. The features for detection of bearing faults are extracted from the extremes of the training signals based on proposed clustering algorithms. In line with the conventional fuzzy C-means (FCM) clustering method, we have proposed the improved fuzzy clustering technique based on heuristic subtractive approach. While the FCM suffers from the convergence and efficiency, the hybrid C-means-Subtractive (FCM-S) clustering benefits from the optimal initial point selection that highly improves its performance and convergence. Not only the experimental results for different test signal scenarios show that the proposed FCM-S clustering approach outperforms the conventional FCM method, but also the FCM-S detects the bearing faults better than the previous ones.",
    "image": "PublicationPage/Bearing-IEEE-Lotfan-2015.png",
    "doi": "https://doi.org/10.1109/FUZZ-IEEE.2015.7338049"
  }
]
